In [1]:
import pandas as pd

In [2]:
data = [['Juan', 36], ['Pedro', 47]]

df = pd.DataFrame(data, columns=['Nombre', 'Edad'])

In [3]:
df

  Nombre  Edad
0   Juan    36
1  Pedro    47

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
data = {
    'Nombre': ['Juan', 'Pedro'],
    'Edad': [36, 47]
}

df=pd.DataFrame(data)

In [6]:
df

  Nombre  Edad
0   Juan    36
1  Pedro    47

In [7]:
df = pd.read_csv('./data/data.csv') # paara traer un archivo csv
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [9]:
df = pd.read_csv('./data/data', sep='|') # para definir el separador del archivo 
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [11]:
df = pd.read_csv('./data/data_without_header', header=None, names=['Nombre', 'Edad', 'Ciudad']) 
# cuando no tiene cabezarea se tiene que indicar y agregar el nombre de las cabecereras
df

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [12]:
df = pd.read_json('./data/data.json')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [13]:
df.head()

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [14]:
df.head(2) #trae los primeros elementos

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona

In [15]:
df.tail(2) #trae los ultimos elementos

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [16]:
df.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   nombre  3 non-null      object
 1   edad    3 non-null      int64
 2   ciudad  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [18]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [19]:
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [20]:
df['nombre'] # para pedir una sola columna, esta es uan serie

0     Juan
1    María
2    Pedro
Name: nombre, dtype: object

In [21]:
df[['nombre', 'edad']] # para medir mas de 1 columna, esta es un dataframe

  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [22]:
df.loc[1] # me trae la fila del registro indicado

nombre        María
edad             30
ciudad    Barcelona
Name: 1, dtype: object

In [23]:
df.loc[[0, 2]] # me trae dos registros

  nombre  edad   ciudad
0   Juan    25   Madrid
2  Pedro    35  Sevilla

In [25]:
df[df['edad'] > 25 ] #para filtrar

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [26]:
data = {
    'grupo': ['A', 'B', 'A', 'B', 'A', 'B'],
    'valor': [25, 30, 50, 35, 15, 40]
}

df = pd.DataFrame(data)
df

  grupo  valor
0     A     25
1     B     30
2     A     50
3     B     35
4     A     15
5     B     40

In [27]:
df.groupby('grupo').mean()# obtenemos el promedio de cada grupo

       valor
grupo
A       30.0
B       35.0

In [28]:
df.groupby('grupo').sum() # para hacer la suma por grupo

       valor
grupo
A         90
B        105

In [29]:
df.groupby('grupo').max() #se obtiene el mayor valor de cada grupo

       valor
grupo
A         50
B         40

In [30]:
def funcion1(n):
    return 3*n

funcion1(5)

15

In [31]:
data = {
    'A': [1, 2, 4, 5, 6],
    'B': [3, 5, 9, 8, 10]
}

df = pd.DataFrame(data)

In [32]:
df['A_doble'] = df['A'].apply(lambda x: x*2) 
#crea una nueva columna y agrega los valores duplciados de la columna a por medio de una funcion lambda
df

   A   B  A_doble
0  1   3        2
1  2   5        4
2  4   9        8
3  5   8       10
4  6  10       12

In [34]:
def duplicar(n):
    return n*2

df['B_doble'] = df['B'].apply(duplicar) # realizamos la misma actividad anyerior utilziando uan funcion
df

   A   B  A_doble  B_doble
0  1   3        2        6
1  2   5        4       10
2  4   9        8       18
3  5   8       10       16
4  6  10       12       20

In [35]:
df['Suma'] = df.apply(lambda row: row['A'] + row['B'], axis=1)
#suma los valores de a y b de cada fila y lo agrega a una nueva columnna
df

   A   B  A_doble  B_doble  Suma
0  1   3        2        6     4
1  2   5        4       10     7
2  4   9        8       18    13
3  5   8       10       16    13
4  6  10       12       20    16

In [38]:
def suma(row): # crea 
    return row['A'] + row['B']

df['Suma_2'] = df.apply(suma, axis=1)
df

   A   B  A_doble  B_doble  Suma  Suma_2
0  1   3        2        6     4       4
1  2   5        4       10     7       7
2  4   9        8       18    13      13
3  5   8       10       16    13      13
4  6  10       12       20    16      16